<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Entitie;

class EntitieSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $branches = [
            'نظم العلومات',
            'استطلاع',
            'اشارة',
            'الامن',
            'البحوث',
            'التدريب',
            'التسليح',
            'التنظيم والادارة',
            'العمليات',
            'القائد',
            'المتابعه',
            'المهندسين',
            'تصوير',
            'حرب الكترونية',
            'حرب كيميائية',
            'رئيس اركان',
            'سكرتارية',
            'شئون ادارية',
            'شئون فنية',
            'شئون معنوية',
            'شئون ظباط',
            'مساعد رئيس اركان',

        ];


        foreach ($branches as $branch) {
            Entitie::create(['name' => $branch,
            'type'=>'internal']);

        }


        $entities = [
           'إدارة الشؤون المعنوية',
           'قيادة قوات حرس الحدود',
           'القوات البرية',
           'القيادة الموحدة لمنطقة شرق القناة',
           'الجيش الثاني الميداني',
           'الجيش الثالث الميداني',
           'قوات المظلات',
           'قوات الدفاع الشعبي والعسكري',
           'قوات حرس الحدود',
           'قوات الدفاع الجوي',
           'القوات البحرية',
           'القوات الجوية',
           'المنطقة الغربية العسكرية',
           'المنطقة الجنوبية العسكرية',
           'المنطقة الشمالية العسكرية',
           'المنطقة المركزية العسكرية',
           'هيئة التسليح',
           'هيئة العمليات',
           'هيئة التدريب',
           'هيئة التفتيش',
           'هيئة البحوث العسكرية',
           'هيئة القضاء العسكري',
           'هيئة التنظيم والإدارة',
           'هيئة الشئون المالية',
           'الكلية البحرية',
           'الكلية الحربية',
           'الكلية الجوية',
           'كلية الدفاع الجوي',
           'كلية القادة والأركان',
           'الكلية الفنية العسكرية',
           'كلية الضباط الاحتياط',
           'كلية الطب العسكري',
           'الكلية العسكرية لعلوم الإدارة',
           'المعهد الفني',
           'معهد ضباط الصف المعلمين',
           'المعهد الصحي',
           'المعهد الفني للتمريض للإناث',
           'معهد المشاة',
           'معهد المدفعية',
           'معهد اللغات',



        ];

        foreach ($entities as $entitie) {
            Entitie::create(['name' => $entitie,
            'type'=>'external']);
            }
    }
    }

